FunMod/DAB-500W-CCS/c2000.syscfg
gpio2.$name           = "REFGEN_IO";
gpio2.direction       = "GPIO_DIR_MODE_OUT";
gpio2.gpioPin.$assign = "hsecDigital.91";

memcfg.config_MEMCFG_SECT_LS0        = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS1        = "CLA_data";
memcfg.init_MEMCFG_SECT_MSGCPUTOCLA1 = true;
memcfg.init_MEMCFG_SECT_MSGCLA1TOCPU = true;

sd1.$name                         = "mySDFM0";
sd1.Use_FilterChannel_1           = true;
sd1.Ch1_DataFilterEnable          = true;
sd1.useInterrupts                 = true;
sd1.Ch1_DataFilter_Representation = "SDFM_DATA_FORMAT_16_BIT";
sd1.Ch1_DOSR                      = 128;
sd1.useCase                       = "SINGLE CLOCK";
sd1.Ch1_FIFO_Enable               = true;
sd1.Ch1_SDFFIL                    = "16";
sd1.SDFFINT                       = ["FILTER1"];
sd1.registerInterrupts            = ["INT_SDFM_DR1"];
sd1.sd.sd_c1Pin.$assign           = "hsecDigital.101";
sd1.sd.sd_d1Pin.$assign           = "hsecDigital.99";
sd1.sd.sd_d2Pin.$assign           = "hsecDigital.103";
sd1.sd.sd_d3Pin.$assign           = "hsecDigital.107";
sd1.sd.sd_d4Pin.$assign           = "hsecDigital.100";
sd1.sdfmIntDr1.enableInterrupt    = true;
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EQEP2 on the Control Card F280039C\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", sd1.sd, "sd_d4Pin");

sfo1.$name = "mySFO0";

controller1.$name            = "PI_CONTROLLER";
controller1.controllerChoice = "PI";
controller1.Umax             = "0.25f";
controller1.Umin             = "-0.25f";
controller1.Imax             = "0.25f";
controller1.Imin             = "-0.25f";
controller1.Kp               = "0.0001f";
controller1.Ki               = "0.6f";

refgen1.$name = "myREFGEN0";
refgen1.ampl  = 10;
refgen1.offs  = 0;
refgen1.freq  = 1000;
refgen1.mode  = "STATIC";
refgen1.umax  = 120;

CMD.activateCMD = true;
CMD.activeCMD   = "CMD_RAM";

CMD1.$name                             = "CMD_RAM";
CMD1.sectionMemory_ramfunc             = ["RAMM0"];
CMD1.sectionMemory_cinit               = ["RAMM0"];
CMD1.sectionMemory_switch              = ["RAMM0"];
CMD1.sectionMemory_stack               = ["RAMM1"];
CMD1.sectionMemory_bss                 = ["RAMLS5"];
CMD1.sectionMemory_init_array          = ["RAMM0"];
CMD1.sectionMemory_sysmem              = ["RAMGS2"];
CMD1.sectionMemory_data                = ["RAMGS0"];
CMD1.sectionMemory_text                = ["RAMGS3","RAMLS3","RAMLS4","RAMLS5","RAMLS6","RAMLS7"];
CMD1.sectionMemory_cla1Prog            = ["RAMLS0"];
CMD1.sectionMemory_claConst            = ["RAMLS1"];
CMD1.sectionMemory_claScratchpad       = ["RAMLS1"];
CMD1.sectionMemory_cla1ToCpuMsgRAM     = ["CLATOCPU_MSGRAM"];
CMD1.sectionMemory_bssCla              = ["RAMLS1"];
CMD1.sectionMemory_cpuToCla1MsgRAM     = ["CPUTOCLA_MSGRAM"];
CMD1.sectionMemory_const               = ["RAMGS2"];
CMD1.userSection.create(1);
CMD1.userSection[0].sectionName        = "dclfuncs";
CMD1.userSection[0].$name              = "dclfuncs_RAM";
CMD1.userSection[0].sectionAlignEnable = true;
CMD1.userSection[0].sectionAlign       = 2;
CMD1.userSection[0].sectionMemory      = ["RAMGS1"];

CMD2.$name                                      = "CMD_FLASH";
CMD2.sectionMemory_ramfunc                      = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_ramfunc                 = true;
CMD2.sectionRunFromDifferentAddr_ramfunc        = true;
CMD2.sectionMemory_text                         = ["FLASH_BANK0_SEC2","FLASH_BANK0_SEC3","FLASH_BANK0_SEC4"];
CMD2.sectionAlignEnable_text                    = true;
CMD2.sectionMemory_binit                        = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_binit                   = true;
CMD2.sectionMemory_cinit                        = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_cinit                   = true;
CMD2.sectionMemory_switch                       = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_switch                  = true;
CMD2.sectionMemory_stack                        = ["RAMM1"];
CMD2.sectionMemory_bss                          = ["RAMLS5"];
CMD2.sectionMemory_init_array                   = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_init_array              = true;
CMD2.sectionMemory_const                        = ["FLASH_BANK0_SEC4"];
CMD2.sectionAlignEnable_const                   = true;
CMD2.sectionMemory_data                         = ["RAMLS5"];
CMD2.sectionMemory_sysmem                       = ["RAMLS5"];
CMD2.sectionMemory_ovly                         = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_ovly                    = true;
CMD2.sectionMemory_codestart                    = "0x080000";
CMD2.sectionRun_ramfunc                         = ["RAMLS3"];
CMD2.userSection.create(1);
CMD2.userSection[0].sectionName                 = "dclfuncs";
CMD2.userSection[0].sectionRunFromDifferentAddr = true;
CMD2.userSection[0].sectionAlignEnable          = true;
CMD2.userSection[0].sectionRun                  = ["RAMLS7"];
CMD2.userSection[0].sectionMemory               = ["FLASH_BANK2_SEC10"];
CMD2.userSection[0].$name                       = "dclfuncs_FLASH";
CMD2.userSection[0].sectionBinit                = false;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.epwm.$suggestSolution           = "EPWM1";
epwm1.epwm.epwm_aPin.$suggestSolution = "hsecDigital.49";
epwm1.epwm.epwm_bPin.$suggestSolution = "hsecDigital.51";
epwm2.epwm.$suggestSolution           = "EPWM2";
epwm2.epwm.epwm_aPin.$suggestSolution = "hsecDigital.53";
epwm2.epwm.epwm_bPin.$suggestSolution = "hsecDigital.55";
epwm3.epwm.$suggestSolution           = "EPWM3";
epwm3.epwm.epwm_aPin.$suggestSolution = "hsecDigital.50";
epwm3.epwm.epwm_bPin.$suggestSolution = "hsecDigital.52";
epwm4.epwm.$suggestSolution           = "EPWM4";
epwm4.epwm.epwm_aPin.$suggestSolution = "hsecDigital.54";
epwm4.epwm.epwm_bPin.$suggestSolution = "hsecDigital.56";
epwm5.epwm.$suggestSolution           = "EPWM5";
epwm5.epwm.epwm_aPin.$suggestSolution = "hsecDigital.57";
epwm5.epwm.epwm_bPin.$suggestSolution = "hsecDigital.59";
sd1.sd.$suggestSolution               = "SD1";
